app/Http/Controllers/DosenController.php

select `dosen`.*, `jurusan`.`jurusan`, `prodi`.`prodi` from `dosen` inner join `jurusan` on `dosen`.`jurusan_id` = `jurusan`.`id_jurusan` inner join `prodi` on `dosen`.`prodi_id` = `prodi`.`id_prodi` order by `id_dosen` desc
---
    public function index()
    {
        $data_dosen = DB::table('dosen')
            ->join('jurusan', 'dosen.jurusan_id', '=', 'jurusan.id_jurusan')
            ->join('prodi', 'dosen.prodi_id', '=', 'prodi.id_prodi')
            ->select('dosen.*', 'jurusan.jurusan', 'prodi.prodi')
            ->orderByDesc('id_dosen')
            ->get();