app/Http/Controllers/MatkulController.php

    public function index()
    {
        $data_matkul = DB::table('matkul')
            ->join('kurikulum', 'matkul.kurikulum_id', '=', 'kurikulum.id_kurikulum')
            ->select('matkul.*', 'kurikulum.nama_kurikulum')
            ->orderByDesc('id_matkul')
            ->get();
---
select `matkul`.*, `kurikulum`.*, `smt_thnakd`.* from `matkul` inner join `kurikulum` on `matkul`.`kurikulum_id` = `kurikulum`.`id_kurikulum` inner join `smt_thnakd` on `matkul`.`smt_thnakd_id` = `smt_thnakd`.`id_smt_thnakd` order by `id_matkul` desc