app/Http/Controllers/Pengurus_kbkController.php

    public function index()
    {
        $data_pengurus_kbk = DB::table('pengurus_kbk')
            ->join('jenis_kbk', 'pengurus_kbk.jenis_kbk_id', '=', 'jenis_kbk.id_jenis_kbk')
            ->join('jabatan_kbk', 'pengurus_kbk.jabatan_kbk_id', '=', 'jabatan_kbk.id_jabatan_kbk')
            ->join('dosen', 'pengurus_kbk.dosen_id', '=', 'dosen.id_dosen')
            ->select('pengurus_kbk.id_pengurus', 'pengurus_kbk.status_pengurus_kbk', 'jenis_kbk.jenis_kbk', 'jabatan_kbk.jabatan', 'dosen.nama_dosen')
            ->orderByDesc('id_pengurus')
            ->get();
---
select `pengurus_kbk`.*, `jenis_kbk`.`jenis_kbk`, `jabatan_kbk`.*, `dosen`.`nama_dosen` from `pengurus_kbk` inner join `jenis_kbk` on `pengurus_kbk`.`jenis_kbk_id` = `jenis_kbk`.`id_jenis_kbk` inner join `jabatan_kbk` on `pengurus_kbk`.`jabatan_kbk_id` = `jabatan_kbk`.`id_jabatan_kbk` inner join `dosen` on `pengurus_kbk`.`dosen_id` = `dosen`.`id_dosen` order by `id_pengurus` desc